[
  {
    "title": "Что такое Arduino?",
    "content": "Arduino — это бренд, под которым производятся официальные электронные платы и программное обеспечение. Интересно, что своё название платформа получила в честь итальянского бара, где её создатели часто собирались.\n\nЕсли говорить о применении, то Arduino — это инструмент для создания прототипов электронных устройств. Платформа состоит из двух основных компонентов:\nАппаратная часть — различные модели плат.\nПрограммная часть — среда разработки для написания кода.\n\nЛинейка Arduino включает несколько вариантов отладочных плат. По сути, это печатные платы с установленным микроконтроллером (МК) — именно его и предстоит программировать. В более простых версиях (например, UNO, Nano, Mega, Leonardo) используются микроконтроллеры AVR, а в современных моделях применяются более мощные ARM Cortex, что позволяет реализовывать сложные проекты."
  },
  {
    "title": "Связь с микроконтроллером",
    "content": "При нажатии кнопки загрузки прошивка компилируется и превращается в машинный код, который загружается в ардуино. Этот процесс необратим: то есть превратить машинный код обратно в написанный вами не получится."
  },
  {
    "title": "Структура прошивки",
    "content": "Прошивка, или иначе программа, состоит из компонентов.\n\nВ начале, как правило, прописывается информация в виде однострочного или многострочного комментария. При компиляции они будут игнорироваться, то есть памяти по сути не занимают.\n\nДалее основные программные блоки: loop() и setup()."
  },
  {
    "title": "setup()",
    "content": "Это блок, который выполняется один раз, сразу после запуска платы или после её перезагрузки. Здесь обычно размещают начальные настройки: указывают, какие пины будут входами, какие — выходами, запускают связь с другими устройствами (например, через USB, Bluetooth или Wi-Fi).\n\nМожно представить, что setup() — это как подготовка сцены перед спектаклем: расставить декорации, включить свет, настроить звук."
  },
  {
    "title": "loop()",
    "content": "Это блок, который начинает выполняться после setup() и повторяется бесконечно, пока включена плата. Здесь размещают основной код программы — то, что Arduino должна делать всё время: считывать данные с датчиков, включать/выключать светодиоды, управлять двигателями и т. д.\n\nМожно сказать, что loop() — это «сердце» прошивки, её основной цикл."
  }
]
